In [1]:
import pandas as pd

In [2]:
items ={'Bob':pd.Series([245,25,55],index=['bike','pants','watch']),'Alice':pd.Series([40,110,500,45],index=['book','glasses','bike','pants'])}
type(items)

dict

In [3]:
shopping_carts = pd.DataFrame(items)
shopping_carts

           Bob  Alice
bike     245.0  500.0
book       NaN   40.0
glasses    NaN  110.0
pants     25.0   45.0
watch     55.0    NaN

In [4]:
data = {'Bob':pd.Series([245,25,55]),'Alice':pd.Series([40,110,500,45])}
df = pd.DataFrame(data)
df

     Bob  Alice
0  245.0     40
1   25.0    110
2   55.0    500
3    NaN     45

In [5]:
shopping_carts.index

Index(['bike', 'book', 'glasses', 'pants', 'watch'], dtype='object')

In [6]:
shopping_carts.columns

Index(['Bob', 'Alice'], dtype='object')

In [7]:
shopping_carts.values

array([[245., 500.],
       [ nan,  40.],
       [ nan, 110.],
       [ 25.,  45.],
       [ 55.,  nan]])

In [8]:
shopping_carts.shape

(5, 2)

In [9]:
# dimension
shopping_carts.ndim

2

In [10]:
shopping_carts.size

10

In [14]:
bob_shopping_cart = pd.DataFrame(items,columns=['Bob'])
bob_shopping_cart

       Bob
bike   245
pants   25
watch   55

In [15]:
sel_shopping_cart = pd.DataFrame(items,index=['pants','book'])
sel_shopping_cart

        Bob  Alice
pants  25.0     45
book    NaN     40

In [16]:
alice_sel_shopping_cart = pd.DataFrame(items,index=['glasses','bike'],columns=['Alice'])
alice_sel_shopping_cart

         Alice
glasses    110
bike       500

In [18]:
data = {'Integers':[1,2,3], 'Floats':[4.5,8.2,9.6]}
df = pd.DataFrame(data,index = ['label1','label2','label3'])
df

        Integers  Floats
label1         1     4.5
label2         2     8.2
label3         3     9.6

In [20]:
items = [{'bikes':20,'pants':30,'watches':35},{'watches':10, 'glasses':50, 'bikes':15, 'pants':5}]

store_items = pd.DataFrame(items, index=['store 1','store 2'])
store_items

         bikes  pants  watches  glasses
store 1     20     30       35      NaN
store 2     15      5       10     50.0

In [21]:
store_items[['bikes']]

         bikes
store 1     20
store 2     15

In [22]:
store_items[['bikes','pants']]

         bikes  pants
store 1     20     30
store 2     15      5

In [24]:
store_items.loc[['store 1']]

         bikes  pants  watches  glasses
store 1     20     30       35      NaN

In [25]:
# column label should always come first
store_items['bikes']['store 2']

15

In [26]:
# add a column
store_items['shirts'] = [15,21]
store_items

         bikes  pants  watches  glasses  shirts
store 1     20     30       35      NaN      15
store 2     15      5       10     50.0      21

In [27]:
store_items['suits'] = store_items['shirts'] + store_items['pants']
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN      15     45
store 2     15      5       10     50.0      21     26

In [28]:
# add a new row(store) 
new_items = [{'bikes':20,'pants':30,'watches':35,'glasses':4}]
new_store = pd.DataFrame(new_items,index = ['store 3'])
new_store

         bikes  pants  watches  glasses
store 3     20     30       35        4

In [29]:
store_items = store_items.append(new_store)
store_items

         bikes  pants  watches  glasses  shirts  suits
store 1     20     30       35      NaN    15.0   45.0
store 2     15      5       10     50.0    21.0   26.0
store 3     20     30       35      4.0     NaN    NaN

In [31]:
# stock store 2 and 3 with new watches
store_items['new_watches'] = store_items['watches'][1:]
store_items

         bikes  pants  watches  glasses  shirts  suits  new_watches
store 1     20     30       35      NaN    15.0   45.0          NaN
store 2     15      5       10     50.0    21.0   26.0         10.0
store 3     20     30       35      4.0     NaN    NaN         35.0

In [32]:
store_items.insert(5,'shoes',[8,5,0])
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits  new_watches
store 1     20     30       35      NaN    15.0      8   45.0          NaN
store 2     15      5       10     50.0    21.0      5   26.0         10.0
store 3     20     30       35      4.0     NaN      0    NaN         35.0

In [33]:
#  pop is used for deleting columns while drop is for both rows and columns
store_items.pop('new_watches')
store_items

         bikes  pants  watches  glasses  shirts  shoes  suits
store 1     20     30       35      NaN    15.0      8   45.0
store 2     15      5       10     50.0    21.0      5   26.0
store 3     20     30       35      4.0     NaN      0    NaN

In [34]:
store_items = store_items.drop(['watches','shoes'],axis = 1)
store_items

         bikes  pants  glasses  shirts  suits
store 1     20     30      NaN    15.0   45.0
store 2     15      5     50.0    21.0   26.0
store 3     20     30      4.0     NaN    NaN

In [36]:
store_items = store_items.drop(['store 1','store 2'],axis = 0)
store_items

         bikes  pants  glasses  shirts  suits
store 3     20     30      4.0     NaN    NaN

In [40]:
store_items = store_items.rename(columns={'bikes':'hats'})
store_items

         hats  pants  glasses  shirts  suits
store 3    20     30      4.0     NaN    NaN

In [41]:
store_items = store_items.rename(index={'store 3':'last store'})
store_items

            hats  pants  glasses  shirts  suits
last store    20     30      4.0     NaN    NaN

In [43]:
# You can also change the index to be one of the columns in the DataFrame.
store_items = store_items.set_index('pants')
store_items

       hats  glasses  shirts  suits
pants
30       20      4.0     NaN    NaN